CertForge: added agent to foundry
